===========================================================
Начальное приближение: [0.0, 0.0, 0.0, 0.0]
============================================================

Метод Якоби
Решение: [1.36610504, -0.76955959, 1.03916913, -0.00794735]
Количество итераций: 13
Достигнутая точность: 4.22e-07 (задана 1e-06)

Метод Зейделя
Решение: [1.36610509, -0.76955957, 1.03916914, -0.00794730]
Количество итераций: 7
Достигнутая точность: 2.65e-07 (задана 1e-06)


============================================================
Начальное приближение: [10.0, 10.0, 10.0, 10.0]
============================================================

Метод Якоби
Решение: [1.36610512, -0.76955954, 1.03916915, -0.00794726]
Количество итераций: 14
Достигнутая точность: 7.98e-07 (задана 1e-06)

Метод Зейделя
Решение: [1.36610503, -0.76955962, 1.03916916, -0.00794732]
Количество итераций: 7
Достигнутая точность: 9.17e-07 (задана 1e-06)


============================================================
Начальное приближение: [100.0, 0.0, -100.0, 50.0]
============================================================

Метод Якоби
Решение: [1.36610511, -0.76955955, 1.03916914, -0.00794729]
Количество итераций: 15
Достигнутая точность: 6.94e-07 (задана 1e-06)

Метод Зейделя
Решение: [1.36610507, -0.76955957, 1.03916914, -0.00794731]
Количество итераций: 9
Достигнутая точность: 1.06e-07 (задана 1e-06)
